{
  "routerjs": {
    "title": "Router.js",
    "subheading": "JavaScript router used for setting handlers for paths. Packaged for use in a browser or Node.js environment.",
    "description": "Router.js was created as I was wanting to create one-page applications but the majority of available options to do so either lacked features or has too many unnecessary ones. My version which I use in all of my one-page applications including this portfolio allows routes to be set up with handlers assigned to them which are executed on a successful path resolve. This is not all however, I also implemented the ability to nest routers for better code management along with adding redirections for when two paths need to use the same handler. This module can be used in a number of ways; the source code can be used as an ES6 directly in a project, the module can also be included from a NPM CDN and finally NPM can be used to directly use the module within Node.js.",
    "images": [],
    "technologies": ["JavaScript", "Rollup.js", "npm"],
    "links": [
      "https://github.com/rootgog/router.js",
      "https://www.npmjs.com/package/@rootgog/router"
    ]
  },
  "volume": {
    "title": "Volume",
    "subheading": "PWA which tracks and analyses workout data. Contains a tracker to track improvised workouts and created routines, along with analysing and presenting data in a readable form.",
    "description": "I created volume as I was unhappy with the fitness tracker apps that are available and wanted to create an app that catered to what I wanted. The project is currently still under development, so a public live version is not available however I am hoping to release it by summer 2020. The app allows routines and programs to be created which can be shared allowing people to interact. The app has a built-in workout tracker which integrates seamlessly. I wanted the app to be available on any device which left me with either developing for systems I have never even heard of or creating a web app which is available on every platform as standard this is why the app is built as a PWA. All of the code for the project is written by me so far. Not a single library has been used. This is not the fastest way for developing an app, but it has been a side project for a long time. Through developing everything by myself it allows me to optimise and reduce any bloat which would come with a library or framework.",
    "images": ["tracker.png", "history.png", "group-editor.png"],
    "technologies": ["Node.js", "JavaScript", "HTML", "CSS"],
    "links": ["https://volume.fitness"]
  },
  "shapetextjs": {
    "title": "ShapeText.js",
    "subheading": "JavaScript module used to create a body of text out of shapes which can be interacted with. Perfect for adding some interaction into a web page.",
    "description": "This module was created as a way to practice with canvas, it allowed me to have a small but complex problem that I could work on which had many transferable skills such as collision calculations, text rendering and most importantly optimisation. As this module creates a large number of objects (shapes) it inherently performs badly on load when processing the inputted text however with improvements it is at an acceptable level. The module is designed for splash pages and is something that can be used to catch the attention of the user.",
    "images": ["demo.png"],
    "technologies": ["Node.js", "JavaScript", "HTML", "CSS"],
    "links": [
      "https://github.com/rootgog/shapetext",
      "https://rootgog.github.io/shapetext/demo"
    ]
  },
  "minimvc": {
    "title": "Mini MVC",
    "subheading": "MiniMVC is a lightweight solution to bind javascript objects to DOM elements",
    "description": "I created MiniMVC as a lightweight alternative to a larger framework such as Vue. This is due to not needing all of the features that the larger frameworks come with. Therefore, MiniMVC only syncronises a data object to DOM elements two way, and thats all.",
    "images": [],
    "technologies": ["JavaScript", "npm"],
    "links": [
      "https://github.com/rootgog/minimvc",
      "https://www.npmjs.com/package/minimvc"
    ]
  },
  "clockclock": {
    "title": "Clock Clock",
    "subheading": "A Clock made of Clocks",
    "description": "An array of clocks organise thir hands to display numbers between them, the class uses canvas and plain JavaScript",
    "images": ["clockclock.png"],
    "technologies": ["JavaScript"],
    "links": [
      "https://github.com/rootgog/clockclock",
      "https://rootgog.github.io/clockclock"
    ]
  }
}
